Revit 2027 API
AreaTag.AreaTagType Property
The tag type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AreaTagType AreaTagType { get; set; }
Public Property AreaTagType As AreaTagType
	Get
	Set
public:
property AreaTagType^ AreaTagType {
	AreaTagType^ get ();
	void set (AreaTagType^ value);
}
member AreaTagType : AreaTagType with get, set
Property Value
AreaTagType
See Also
Reference
AreaTag Class
Autodesk.Revit.DB Namespace